In [11]:
import sqlite3

In [12]:
# Connect to in-memory SQLite database
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

In [3]:
# Create DEPT table
cursor.execute("""
CREATE TABLE DEPT (
 DEPTNO INTEGER PRIMARY KEY,
 DNAME TEXT,
 LOC TEXT
)
""")

In [4]:
# Create EMP table
cursor.execute("""
CREATE TABLE EMP (
 EMPNO INTEGER PRIMARY KEY,
 ENAME TEXT,
 JOB TEXT,
 MGR INTEGER,
 HIREDATE TEXT,
 SAL REAL,
 COMM REAL,
 DEPTNO INTEGER,
 FOREIGN KEY (DEPTNO) REFERENCES DEPT(DEPTNO)
)
""")

In [5]:
# Insert sample data into DEPT
dept_data = [
 (10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')
]
cursor.executemany("INSERT INTO DEPT VALUES (?, ?, ?)", dept_data)

In [6]:
# Insert sample data into EMP
emp_data = [
 (7839, 'KING', 'PRESIDENT', None, '1981-11-17', 5000, None, 10),
 (7566, 'JONES', 'MANAGER', 7839, '1981-04-02', 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, '1981-05-01', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '1981-06-09', 2450, None, 10),
 (7902, 'FORD', 'ANALYST', 7566, '1981-12-03', 3000, None, 20),
 (7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '1981-02-20', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '1981-02-22', 1250, 500, 30),
 (7654, 'MARTIN', 'SALESMAN', 7698, '1981-09-28', 1250, 1400, 30),
 (7844, 'TURNER', 'SALESMAN', 7698, '1981-06-09', 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '1983-01-12', 1100, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, '1982-01-23', 1300, None, 10)
]
cursor.executemany("INSERT INTO EMP VALUES (?, ?, ?, ?, ?, ?, ?, ?)", emp_data)

In [24]:
# List of 30 SQL commands
sql_commands = [
 # Basic Search & Filtering
 "SELECT * FROM EMP",
 "SELECT ENAME, SAL FROM EMP WHERE SAL > 3000",
 "SELECT ENAME FROM EMP WHERE JOB = 'MANAGER'",
 "SELECT ENAME, DEPTNO FROM EMP WHERE DEPTNO = 10",
 "SELECT ENAME FROM EMP WHERE HIREDATE BETWEEN '1981-01-01' AND '1981-12-31'",
 # Pattern Matching with LIKE
 "SELECT ENAME FROM EMP WHERE ENAME LIKE 'S%'",
 "SELECT ENAME FROM EMP WHERE ENAME LIKE '%N'",
 "SELECT ENAME FROM EMP WHERE ENAME LIKE '_A%'",
 "SELECT ENAME FROM EMP WHERE ENAME LIKE 'A%'",
 "SELECT ENAME FROM EMP WHERE ENAME NOT LIKE '%R%'",
 # Grouping & Aggregation
 "SELECT DEPTNO, COUNT(*) FROM EMP GROUP BY DEPTNO",
 "SELECT JOB, AVG(SAL) FROM EMP GROUP BY JOB",
 "SELECT DEPTNO, MAX(SAL), MIN(SAL) FROM EMP GROUP BY DEPTNO",
 "SELECT JOB, SUM(SAL) FROM EMP GROUP BY JOB",
 "SELECT DEPTNO, COUNT(*) AS EMP_COUNT FROM EMP GROUP BY DEPTNO",
 # HAVING Clause
 "SELECT DEPTNO, AVG(SAL) FROM EMP GROUP BY DEPTNO HAVING AVG(SAL) > 3000",
 "SELECT JOB, COUNT(*) FROM EMP GROUP BY JOB HAVING COUNT(*) > 2",
 "SELECT DEPTNO, SUM(SAL) FROM EMP GROUP BY DEPTNO HAVING SUM(SAL) < 10000",
 "SELECT JOB, MAX(SAL) FROM EMP GROUP BY JOB HAVING MAX(SAL) > 4000",
 "SELECT DEPTNO, COUNT(*) FROM EMP GROUP BY DEPTNO HAVING COUNT(*) BETWEEN 2 AND 5",
 # Joins (LEFT, RIGHT, FULL)
 "SELECT E.ENAME, D.DNAME FROM EMP E LEFT JOIN DEPT D ON E.DEPTNO = D.DEPTNO",
 # RIGHT JOIN not supported in SQLite, simulate using LEFT JOIN + UNION
 "SELECT E.ENAME, D.DNAME FROM DEPT D LEFT JOIN EMP E ON E.DEPTNO = D.DEPTNO",
 # FULL OUTER JOIN not supported, simulate using UNION of LEFT and RIGHT
 """SELECT E.ENAME, D.DNAME FROM EMP E LEFT JOIN DEPT D ON E.DEPTNO = D.DEPTNO UNION
 SELECT E.ENAME, D.DNAME FROM DEPT D LEFT JOIN EMP E ON E.DEPTNO = D.DEPTNO""",
 "SELECT E.ENAME, D.LOC FROM EMP E LEFT JOIN DEPT D ON E.DEPTNO = D.DEPTNO WHERE D.LOC = 'NEW YORK'",
 "SELECT D.DNAME, COUNT(E.EMPNO) FROM DEPT D LEFT JOIN EMP E ON D.DEPTNO = E.DEPTNO GROUP BY D.DNAME",
 # Ordering Results
 "SELECT ENAME, SAL FROM EMP ORDER BY SAL DESC",
 "SELECT ENAME, HIREDATE FROM EMP ORDER BY HIREDATE ASC",
 "SELECT ENAME, JOB FROM EMP ORDER BY JOB, ENAME",
 "SELECT ENAME, DEPTNO FROM EMP ORDER BY DEPTNO, ENAME",
 "SELECT ENAME, SAL FROM EMP ORDER BY SAL DESC LIMIT 5"
]

In [9]:
rows=cursor.execute("SELECT * FROM EMP")
for row in rows:
    print(row)

(7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800.0, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, '1981-02-20', 1600.0, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698, '1981-02-22', 1250.0, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839, '1981-04-02', 2975.0, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, '1981-09-28', 1250.0, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839, '1981-05-01', 2850.0, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, '1981-06-09', 2450.0, None, 10)
(7839, 'KING', 'PRESIDENT', None, '1981-11-17', 5000.0, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, '1981-06-09', 1500.0, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788, '1983-01-12', 1100.0, None, 20)
(7902, 'FORD', 'ANALYST', 7566, '1981-12-03', 3000.0, None, 20)
(7934, 'MILLER', 'CLERK', 7782, '1982-01-23', 1300.0, None, 10)

In [10]:
rows=cursor.execute("SELECT ENAME, SAL FROM EMP WHERE SAL > 3000")
for row in rows:
    print(row)

('KING', 5000.0)

In [25]:
# Execute and display results
for i, query in enumerate(sql_commands, start=1):
    print(f"\nQuery {i}: {query}")
    cursor.execute(query)

    # Try to fetch results (only works for SELECT or queries that return rows)
    try:
        rows = cursor.fetchall()
        if rows:
            for row in rows:
                print(row)
        else:
            print("Query executed successfully (no rows returned).")
    except:
        print("Query executed successfully (no result set).")

Query 1: SELECT * FROM EMP
(7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800.0, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, '1981-02-20', 1600.0, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698, '1981-02-22', 1250.0, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839, '1981-04-02', 2975.0, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, '1981-09-28', 1250.0, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839, '1981-05-01', 2850.0, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, '1981-06-09', 2450.0, None, 10)
(7839, 'KING', 'PRESIDENT', None, '1981-11-17', 5000.0, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, '1981-06-09', 1500.0, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788, '1983-01-12', 1100.0, None, 20)
(7902, 'FORD', 'ANALYST', 7566, '1981-12-03', 3000.0, None, 20)
(7934, 'MILLER', 'CLERK', 7782, '1982-01-23', 1300.0, None, 10)

Query 2: SELECT ENAME, SAL FROM EMP WHERE SAL > 3000
('KING', 5000.0)

Query 3: SELECT ENAME FROM EMP WHERE JOB = 'MANAGER'
('JONES',)
('BLAKE',)
('CLARK',)

Query 4: SELECT ENAME, DEPTNO FROM EMP WHERE DEPTNO = 10
('CLARK', 10)
('KING', 10)
('MILLER', 10)

Query 5: SELECT ENAME FROM EMP WHERE HIREDATE BETWEEN '1981-01-01' AND '1981-12-31'
('ALLEN',)
('WARD',)
('JONES',)
('MARTIN',)
('BLAKE',)
('CLARK',)
('KING',)
('TURNER',)
('FORD',)

Query 6: SELECT ENAME FROM EMP WHERE ENAME LIKE 'S%'
('SMITH',)

Query 7: SELECT ENAME FROM EMP WHERE ENAME LIKE '%N'
('ALLEN',)
('MARTIN',)

Query 8: SELECT ENAME FROM EMP WHERE ENAME LIKE '_A%'
('WARD',)
('MARTIN',)

Query 9: SELECT ENAME FROM EMP WHERE ENAME LIKE 'A%'
('ALLEN',)
('ADAMS',)

Query 10: SELECT ENAME FROM EMP WHERE ENAME NOT LIKE '%R%'
('SMITH',)
('ALLEN',)
('JONES',)
('BLAKE',)
('KING',)
('ADAMS',)

Query 11: SELECT DEPTNO, COUNT(*) FROM EMP GROUP BY DEPTNO
(10, 3)
(20, 4)
(30, 5)

Query 12: SELECT JOB, AVG(SAL) FROM EMP GROUP BY JOB
('ANALYST', 3000.0)
('CLERK', 1066.6666666666667)
('MANAGER', 2758.3333333333335)
('PRESIDENT', 5000.0)
('SALESMAN', 1400.0)

Query 13: SELECT DEPTNO, MAX(SAL), MIN(SAL) FROM EMP GROUP BY DEPTNO
(10, 5000.0, 1300.0)
(20, 3000.0, 800.0)
(30, 2850.0, 1250.0)

Query 14: SELECT JOB, SUM(SAL) FROM EMP GROUP BY JOB
('ANALYST', 3000.0)
('CLERK', 3200.0)
('MANAGER', 8275.0)
('PRESIDENT', 5000.0)
('SALESMAN', 5600.0)

Query 15: SELECT DEPTNO, COUNT(*) AS EMP_COUNT FROM EMP GROUP BY DEPTNO
(10, 3)
(20, 4)
(30, 5)

Query 16: SELECT DEPTNO, AVG(SAL) FROM EMP GROUP BY DEPTNO HAVING AVG(SAL) > 3000
Query executed successfully (no rows returned).

Query 17: SELECT JOB, COUNT(*) FROM EMP GROUP BY JOB HAVING COUNT(*) > 2
('CLERK', 3)
('MANAGER', 3)
('SALESMAN', 4)

Query 18: SELECT DEPTNO, SUM(SAL) FROM EMP GROUP BY DEPTNO HAVING SUM(SAL) < 10000
(10, 8750.0)
(20, 7875.0)
(30, 8450.0)

Query 19: SELECT JOB, MAX(SAL) FROM EMP GROUP BY JOB HAVING MAX(SAL) > 4000
('PRESIDENT', 5000.0)

Query 20: SELECT DEPTNO, COUNT(*) FROM EMP GROUP BY DEPTNO HAVING COUNT(*) BETWEEN 2 AND 5
(10, 3)
(20, 4)
(30, 5)

Query 21: SELECT E.ENAME, D.DNAME FROM EMP E LEFT JOIN DEPT D ON E.DEPTNO = D.DEPTNO
('SMITH', 'RESEARCH')
('ALLEN', 'SALES')
('WARD', 'SALES')
('JONES', 'RESEARCH')
('MARTIN', 'SALES')
('BLAKE', 'SALES')
('CLARK', 'ACCOUNTING')
('KING', 'ACCOUNTING')
('TURNER', 'SALES')
('ADAMS', 'RESEARCH')
('FORD', 'RESEARCH')
('MILLER', 'ACCOUNTING')

Query 22: SELECT E.ENAME, D.DNAME FROM DEPT D LEFT JOIN EMP E ON E.DEPTNO = D.DEPTNO
('CLARK', 'ACCOUNTING')
('KING', 'ACCOUNTING')
('MILLER', 'ACCOUNTING')
('ADAMS', 'RESEARCH')
('FORD', 'RESEARCH')
('JONES', 'RESEARCH')
('SMITH', 'RESEARCH')
('ALLEN', 'SALES')
('BLAKE', 'SALES')
('MARTIN', 'SALES')
('TURNER', 'SALES')
('WARD', 'SALES')
(None, 'OPERATIONS')

Query 23: SELECT E.ENAME, D.DNAME FROM EMP E LEFT JOIN DEPT D ON E.DEPTNO = D.DEPTNO UNION
 SELECT E.ENAME, D.DNAME FROM DEPT D LEFT JOIN EMP E ON E.DEPTNO = D.DEPTNO
(None, 'OPERATIONS')
('ADAMS', 'RESEARCH')
('ALLEN', 'SALES')
('BLAKE', 'SALES')
('CLARK', 'ACCOUNTING')
('FORD', 'RESEARCH')
('JONES', 'RESEARCH')
('KING', 'ACCOUNTING')
('MARTIN', 'SALES')
('MILLER', 'ACCOUNTING')
('SMITH', 'RESEARCH')
('TURNER', 'SALES')
('WARD', 'SALES')

Query 24: SELECT E.ENAME, D.LOC FROM EMP E LEFT JOIN DEPT D ON E.DEPTNO = D.DEPTNO WHERE D.LOC = 'NEW YORK'
('CLARK', 'NEW YORK')
('KING', 'NEW YORK')
('MILLER', 'NEW YORK')

Query 25: SELECT D.DNAME, COUNT(E.EMPNO) FROM DEPT D LEFT JOIN EMP E ON D.DEPTNO = E.DEPTNO GROUP BY D.DNAME
('ACCOUNTING', 3)
('OPERATIONS', 0)
('RESEARCH', 4)
('SALES', 5)

Query 26: SELECT ENAME, SAL FROM EMP ORDER BY SAL DESC
('KING', 5000.0)
('FORD', 3000.0)
('JONES', 2975.0)
('BLAKE', 2850.0)
('CLARK', 2450.0)
('ALLEN', 1600.0)
('TURNER', 1500.0)
('MILLER', 1300.0)
('WARD', 1250.0)
('MARTIN', 1250.0)
('ADAMS', 1100.0)
('SMITH', 800.0)

Query 27: SELECT ENAME, HIREDATE FROM EMP ORDER BY HIREDATE ASC
('SMITH', '1980-12-17')
('ALLEN', '1981-02-20')
('WARD', '1981-02-22')
('JONES', '1981-04-02')
('BLAKE', '1981-05-01')
('CLARK', '1981-06-09')
('TURNER', '1981-06-09')
('MARTIN', '1981-09-28')
('KING', '1981-11-17')
('FORD', '1981-12-03')
('MILLER', '1982-01-23')
('ADAMS', '1983-01-12')

Query 28: SELECT ENAME, JOB FROM EMP ORDER BY JOB, ENAME
('FORD', 'ANALYST')
('ADAMS', 'CLERK')
('MILLER', 'CLERK')
('SMITH', 'CLERK')
('BLAKE', 'MANAGER')
('CLARK', 'MANAGER')
('JONES', 'MANAGER')
('KING', 'PRESIDENT')
('ALLEN', 'SALESMAN')
('MARTIN', 'SALESMAN')
('TURNER', 'SALESMAN')
('WARD', 'SALESMAN')

Query 29: SELECT ENAME, DEPTNO FROM EMP ORDER BY DEPTNO, ENAME
('CLARK', 10)
('KING', 10)
('MILLER', 10)
('ADAMS', 20)
('FORD', 20)
('JONES', 20)
('SMITH', 20)
('ALLEN', 30)
('BLAKE', 30)
('MARTIN', 30)
('TURNER', 30)
('WARD', 30)

Query 30: SELECT ENAME, SAL FROM EMP ORDER BY SAL DESC LIMIT 5
('KING', 5000.0)
('FORD', 3000.0)
('JONES', 2975.0)
('BLAKE', 2850.0)
('CLARK', 2450.0)

In [26]:
# Commit changes for queries like INSERT, UPDATE, DELETE
conn.commit()
conn.close()